; domain
(define (domain Nenuphars)

  (:requirements :strips :typing)

  (:types 
        place physobj player - object
        obstacle equipable - physobj
        nenuphar - place
        bonus swampflower - equipable
        thorns - obstacle
        scissors fishrod - bonus
  )

  (:predicates 	
    (in-pl ?pl - player ?loc - nenuphar)
    (is-obs ?obs - obstacle ?loc - nenuphar)
    (at ?eq - equipable ?loc - nenuphar)
    (keep-flower)
    (keep-scissors)
    (keep-fishrod)
    (connected ?con1 - nenuphar ?con2 - nenuphar)
  )
  
  (:action CutThorns
    :parameters (?pl - player ?loc-from - nenuphar ?loc-to - nenuphar ?obs - thorns)
    :precondition (and (or (connected ?loc-from ?loc-to) (connected ?loc-to ?loc-from)) (in-pl ?pl ?loc-from) (is-obs ?obs ?loc-to) (keep-scissors))
    :effect (not (is-obs ?obs ?loc-to))
  )
  
  (:action MakeASuperJump
    :parameters (?pl - player ?loc-from - nenuphar ?loc-to - nenuphar ?obs - thorns)
    :precondition (and (in-pl ?pl ?loc-from) (not (is-obs ?obs ?loc-to)) (keep-fishrod))
    :effect (and (not (in-pl ?pl ?loc-from)) (in-pl ?pl ?loc-to))
  )
  
  (:action JumpToAnotherNenuphar
    :parameters (?pl - player ?loc-from - nenuphar ?loc-to - nenuphar ?obs - thorns)
    :precondition (and (or (connected ?loc-from ?loc-to) (connected ?loc-to ?loc-from)) (in-pl ?pl ?loc-from) (not (is-obs ?obs ?loc-to)))
    :effect (and (not (in-pl ?pl ?loc-from)) (in-pl ?pl ?loc-to))
  )
  
  (:action TakeSwampFlower
    :parameters (?pl - player ?loc - nenuphar ?eq - swampflower ?obs - thorns)
    :precondition (and (in-pl ?pl ?loc) (not (keep-flower)) (at ?eq ?loc) (not (is-obs ?obs ?loc)))
    :effect (and (keep-flower) (not (at ?eq ?loc)))
  )
  
  (:action PutSwampFlower
    :parameters (?pl - player ?loc - nenuphar ?eq - swampflower ?obs - thorns)
    :precondition (and (in-pl ?pl ?loc) (keep-flower) (not (at ?eq ?loc)) (not (is-obs ?obs ?loc)))
    :effect (and (not (keep-flower)) (at ?eq ?loc))
  )
  
  (:action EquipScissors
    :parameters (?pl - player ?loc - nenuphar ?eq - scissors)
    :precondition (and (in-pl ?pl ?loc) (at ?eq ?loc))
    :effect (and (not (at ?eq ?loc)) (keep-scissors) (not (keep-fishrod)))
  )
  
  (:action EquipFishrod
    :parameters (?pl - player ?loc - nenuphar ?eq - fishrod)
    :precondition (and (in-pl ?pl ?loc) (at ?eq ?loc))
    :effect (and (not (at ?eq ?loc)) (keep-fishrod) (not (keep-scissors)))
  )
)

; problem
(define (problem p01)
  (:domain Nenuphars)

  (:objects
    player1 - player
    n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 n11 n12 n13 n14 n15 n16 n17 n18 n19 n20 n21 n22 n23 n24 n25 n26 n27 n28 n29 n30 n31 n32 n33 n34 n35 n36 - nenuphar
    scissorsbonus - scissors
    fishrodbonus - fishrod
    thorns - thorns
    flower1 flower2 flower3 - swampflower
  )

  (:init
    (connected n1 n2)
    (connected n1 n7)
    (connected n2 n3)
    (connected n2 n8)
    (connected n3 n4)
    (connected n3 n9)
    (connected n4 n5)
    (connected n4 n10)
    (connected n5 n6)
    (connected n5 n11)
    (connected n6 n12)
    (connected n7 n8)
    (connected n7 n13)
    (connected n8 n9)
    (connected n8 n14)
    (connected n9 n10)
    (connected n9 n15)
    (connected n10 n11)
    (connected n10 n16)
    (connected n11 n12)
    (connected n11 n17)
    (connected n12 n18)
    (connected n13 n14)
    (connected n13 n19)
    (connected n14 n15)
    (connected n14 n20)
    (connected n15 n16)
    (connected n15 n21)
    (connected n16 n17)
    (connected n16 n22)
    (connected n17 n18)
    (connected n17 n23)
    (connected n18 n24)
    (connected n19 n20)
    (connected n19 n25)
    (connected n20 n21)
    (connected n20 n26)
    (connected n21 n22)
    (connected n21 n27)
    (connected n22 n23)
    (connected n22 n28)
    (connected n23 n24)
    (connected n23 n29)
    (connected n24 n30)
    (connected n25 n26)
    (connected n25 n31)
    (connected n26 n27)
    (connected n26 n32)
    (connected n27 n28)
    (connected n27 n33)
    (connected n28 n29)
    (connected n28 n34)
    (connected n29 n30)
    (connected n29 n35)
    (connected n30 n36)
    (connected n31 n32)
    (connected n32 n33)
    (connected n33 n34)
    (connected n34 n35)
    (connected n35 n36)
    
    
    (in-pl player1 n15)
    
    (at flower1 n5)
    (at flower2 n27)
    (at flower3 n11)
    
    (keep-scissors)
    (at fishrodbonus n5)
    
    
    (is-obs thorns n4)
    (is-obs thorns n25)
    (is-obs thorns n14)
    (is-obs thorns n26)
    (is-obs thorns n30)
    (is-obs thorns n12)
    
  )

  (:goal (and (at flower1 n26) (at flower2 n35) (at flower3 n2)))
)

; plan
1. (jumptoanothernenuphar player1 n15 n21 thorns)
   deleted: (in-pl player1 n15)
   added: (in-pl player1 n21)
   goals met: 0 of 3
2. (jumptoanothernenuphar player1 n21 n27 thorns)
   deleted: (in-pl player1 n21)
   added: (in-pl player1 n27)
   goals met: 0 of 3
3. (takeswampflower player1 n27 flower2 thorns)
   deleted: (at flower2 n27)
   added: (keep-flower)
   goals met: 0 of 3
4. (cutthorns player1 n27 n26 thorns)
   deleted: (is-obs thorns n26)
   goals met: 0 of 3
5. (jumptoanothernenuphar player1 n27 n26 thorns)
   deleted: (in-pl player1 n27)
   added: (in-pl player1 n26)
   goals met: 0 of 3
6. (putswampflower player1 n26 flower1 thorns)
   deleted: (keep-flower)
   added: (at flower1 n26)
   goals met: 1 of 3
7. (jumptoanothernenuphar player1 n26 n20 thorns)
   deleted: (in-pl player1 n26)
   added: (in-pl player1 n20)
   goals met: 1 of 3
8. (cutthorns player1 n20 n14 thorns)
   deleted: (is-obs thorns n14)
   goals met: 1 of 3
9. (jumptoanothernenuphar player1 n20 n14 thorns)
   deleted: (in-pl player1 n20)
   added: (in-pl player1 n14)
   goals met: 1 of 3
10. (jumptoanothernenuphar player1 n14 n8 thorns)
   deleted: (in-pl player1 n14)
   added: (in-pl player1 n8)
   goals met: 1 of 3
11. (jumptoanothernenuphar player1 n8 n9 thorns)
   deleted: (in-pl player1 n8)
   added: (in-pl player1 n9)
   goals met: 1 of 3
12. (jumptoanothernenuphar player1 n9 n10 thorns)
   deleted: (in-pl player1 n9)
   added: (in-pl player1 n10)
   goals met: 1 of 3
13. (jumptoanothernenuphar player1 n10 n11 thorns)
   deleted: (in-pl player1 n10)
   added: (in-pl player1 n11)
   goals met: 1 of 3
14. (takeswampflower player1 n11 flower3 thorns)
   deleted: (at flower3 n11)
   added: (keep-flower)
   goals met: 1 of 3
15. (jumptoanothernenuphar player1 n11 n5 thorns)
   deleted: (in-pl player1 n11)
   added: (in-pl player1 n5)
   goals met: 1 of 3
16. (equipfishrod player1 n5 fishrodbonus)
   deleted: (at fishrodbonus n5) (keep-scissors)
   added: (keep-fishrod)
   goals met: 1 of 3
17. (makeasuperjump player1 n5 n35 thorns)
   deleted: (in-pl player1 n5)
   added: (in-pl player1 n35)
   goals met: 1 of 3
18. (putswampflower player1 n35 flower2 thorns)
   deleted: (keep-flower)
   added: (at flower2 n35)
   goals met: 2 of 3
19. (makeasuperjump player1 n35 n5 thorns)
   deleted: (in-pl player1 n35)
   added: (in-pl player1 n5)
   goals met: 2 of 3
20. (takeswampflower player1 n5 flower1 thorns)
   deleted: (at flower1 n5)
   added: (keep-flower)
   goals met: 2 of 3
21. (makeasuperjump player1 n5 n2 thorns)
   deleted: (in-pl player1 n5)
   added: (in-pl player1 n2)
   goals met: 2 of 3
22. (putswampflower player1 n2 flower3 thorns)
   deleted: (keep-flower)
   added: (at flower3 n2)
   goals met: 3 of 3
